{
  "entry": [
        {
            "q1": "Gabriel Davidov-Pardo",
            "q2": "DBH College of Agriculture",
            "q3": "Nutrition and Food Science",
            "q4": "New Food Product Development FST 4290L: From the Classroom to National Competitions",
            "q6": "Yes",
            "q8": "Curricular",
            "q9": "FST 4290 and FST 4290L",
            "q10": "1-semester",
            "q12": "Every year",
            "q14": "Students in the following majors, Senior, Graduate students",
            "q15": "Food Science and Technology, MS in Agriculture-Nutrition and Food Science Option, FST Minor, Culinology minor",
            "q16": "Yes",
            "q17": "Prerequisite(s): C- or better in the following: FST 3180 or FST 318, FST 3220 or FST 322, FST 3250 or FST 325, FST 3321 or FST 332, BIO 2060 or\r\nMIC 201, BIO 2060L or MIC 201L; CHM 2010 or CHM 201, and CHM 2010L or CHM 250L. Corequisite(s): FST 4290.",
            "q18": "No",
            "application-id": "971",
            "email": "gdavidov@cpp.edu",
            "description": "During Fall semester, FST 4290L is a 2 unit laboratory, which means that the groups gather in the laboratory twice a week for 2:50 hours each time. During this time, I supervise the work of the students in the ideation sessions, prototype making, collection of quality parameters and assessing the sensory acceptability of the products. I also provide feedback on the reports to encourage critical think focus on technical problem solving to obtain the best possible prototype. \n\nNevertheless, mentorship and advising of the food product development teams does not finish at the end of the semester, in most cases the deadlines to submit the preliminary proposals to the national competitions and the final proposals, if selected as finalists, happen in the semester following the course. There is still a fair amount of work to refine and making the prototypes for the competitions, reviewing and revising the preliminary proposals, writing the full proposals and creating and practicing the oral and poster presentations. Besides the investment of time required by the students and me to conduct the activities described above, the challenges are mainly related to the lack of structure that the course provides once the semester is over and mainly the lack of assigned time to conduct the activities. \n\nFinally, the teams that submit their projects for competitions receive feedback from highly qualified judges from industry and academia that also help to guide the future development of the projects and can be consider a type of mentorship."

        },
        {
            "q1": "Winny Dong",
            "q2": "Engineering",
            "q3": "Chemical and Materials Engineering",
            "q4": "Hatchery",
            "q5": "none",
            "q6": "Yes",
            "q8": "Co-curricular",
            "q10": "1 academic year",
            "q12": "Every year",
            "q14": "Students in the following majors",
            "q15": "all",
            "q16": "Yes",
            "q17": "I don't know",
            "q18": "Yes",
            "q19": "3.0",
            "application-id": "2",
            "description": ""
        },
        {
            "q1": "Jeremy Jurgens",
            "q2": "Office of Academic Innovation",
            "q3": "Learn Through Discovery",
            "q4": "Projects Hatchery",
            "q5": "https://www.cpp.edu/learndiscovery/hatchery/index.shtml",
            "q6": "No",
            "q7": "Winny Dong &lt;winnydong@cpp.edu&gt;",
            "q8": "Co-curricular",
            "q10": "Other",
            "q11": "This is a \"go at your own pace\" program, so the length of time is dependent on how long the process is from conception to completion",
            "q12": "Every semester",
            "q14": "Students in any major, Freshmen, Sophomore, Junior, Senior, Graduate students",
            "q16": "No",
            "q18": "No",
            "application-id": "995",
            "email": "jjurgens@cpp.edu",
            "description": "Students receive mentorship from three sources. The first is through their faculty mentor, and any additional project mentors they take on. These mentors provide the most in-depth mentorship as they guide the students through the entire project development and implementation process.\n\nThe second is through Hatchery staff advisors and the Hatchery program itself. The Hatchery program's phases help provide students with a map to guide them through development and implementation. In the beginning of Phase I students also meet with the coordinator to develop their first action plan. In this meeting the coordinator ascertains the best way to make the Hatchery fit the team's needs. New teams are also required to present their project idea at a new team meeting attended by other new teams and the Hatchery advisors. After their presentation they receive feedback from their peers and the advisors. Advisors continue to provide feedback from team presentations, and meet with teams throughout their time in the Hatchery to help provide guidance on their projects.\n\nThe third method of mentorship comes from students' peers in the Hatchery. During Hatchery meetings Phase III teams are required to attend, and Phase I and II teams have the option to attend. Phase III teams present on the status of their projects and receive feedback from both advisors and peers. Their peers offer suggestions for troubleshooting issues and present alternative ideas for further research and exploration. Furthermore, the last portion of the meeting is dedicated to small group discussions. These discussions are largely student led and provide teams with the opportunity to learn from, and seek advice from, their peers."
        },
        {
            "q1": "Linchi Kwok",
            "q2": "Collins College of Hospitality Management",
            "q3": "Collins College of Hospitality Management",
            "q4": "Market Analysis in the Lodging Industry",
            "q6": "Yes",
            "q8": "Curricular",
            "q9": "HRT 4990 and HRT 4000",
            "q10": "1 calendar year",
            "q12": "Every year",
            "q14": "Students in any major, Freshmen, Sophomore, Junior, Senior, Graduate students",
            "q16": "No",
            "q18": "No",
            "application-id": "994",
            "email": "lkwok@cpp.edu",
            "description": "This course builds in counseling sessions where students will go over their analysis in front of the professor for feedback. The students will also engage with the Board of Advisors and the alumni as they get ready to present the results of their analysis. Besides being surprised in data analytics, students will receive advice regarding business demeanors, public speaking skills, and tips on professional attires. Many of these skills are transferable and can greatly benefit students’ future careers in the hospitality industry. \n\n "
        },
        {
            "q1": "Ann Lara",
            "q2": "The Collins College Of Hospitality Management",
            "q3": "The Collins College Of Hospitality Management",
            "q4": "Professional Work Experience Course",
            "q6": "Yes",
            "q8": "Curricular",
            "q9": "HRT 3410",
            "q10": "1-semester",
            "q12": "Every semester",
            "q14": "Students in any major, Junior, Senior",
            "q15": "Hospitality Management",
            "q16": "Yes",
            "q17": "Complete 800 hours of hospitality work experience",
            "q18": "No",
            "application-id": "972",
            "email": "aelara@cpp.edu",
            "description": "Students receive mentorship during this course through the completion of their assignments. \n\n\n\tInformational Interviewing allows students to closely interact with potential mentors while learning about their personal journey through their careers. \n\tPersonalized feedback provided to each student from their instructor, and their peers on one of their most important job searching tools, their resume. This feedback is given through grading feedback and discussion board posts. \n\n\n "
        },
        {
            "q1": "Joanne Sohn",
            "q2": "College of Agriciulture",
            "q3": "Animal and Veterinary Sciences",
            "q4": "PolyPet Spa Day and Vaccine Clinic",
            "q5": "n/a",
            "q6": "Yes",
            "q8": "Curricular",
            "q9": "AHS 1129L, AHS 3263L, AHS 4407L",
            "q10": "1-semester",
            "q12": "Every semester",
            "q14": "Students in the following majors, Freshmen, Senior",
            "q15": "Animal Health Science",
            "q16": "Yes",
            "q17": "AHS 1129L Animal handling and restraint",
            "q18": "No",
            "application-id": "973",
            "email": "jsohn@cpp.edu",
            "description": "Students are shown how to perform these skills by the instructors . Due to the fact this is a specialized, clinical skill, one on one instruction is required for a prolonged period of time."
        },
        {
            "q1": "Dr. Jason Turcotte",
            "q2": "CLASS",
            "q3": "Communication",
            "q4": "The Poly Post (news lab)",
            "q5": "https://thepolypost.com/",
            "q6": "Yes",
            "q8": "Curricular, Co-curricular",
            "q9": "COM3351 Newspaper Practices & COM4451 Adv. Newspaper Practices",
            "q10": "1 academic year",
            "q12": "Every semester",
            "q14": "Students in the following majors",
            "q15": "Communication majors or minors. It is required experience for multimedia journalism students, but other Com majors and minors with the prerequisites (COM1106/1107 and COM2217) may enroll. For those who do not meet the prerequisites, we welcome them to participate as freelance writers, photographers, graphic designers, and marketing/advertising associates.",
            "q16": "Yes",
            "q17": "COM1106 or 1107 Copyediting and COM2217 Reporting",
            "q18": "No",
            "application-id": "974",
            "email": "jmturcotte@cpp.edu",
            "description": "Comprehensive mentoring is a key component of the news lab. The lab is advised by Jason Turcotte, an associate professor in the Communication Department. He was editor of his college paper and worked in the news industry for seven years. The editorial advisor assists the students in developing a news budget, helps them refine their writing, offers layout and design advice, and helps them navigate journalism ethics and their relationships with sources. In addition to the regularly scheduled class\/lab meetings, the adviser spends Sunday afternoons with the editors to guide them in the news production process. The adviser is on-call and editors have access to their mentoring at any point during the semester. Intense mentoring also occurs between the more experienced student-editors and the new staff writers. They help lead writing workshops, they assign stories, edit and fact check copy for the reporters.\n\nIn addition, The Poly Post Business Manager, Linda Perez, mentors students from disciplines outside of communication in the areas of business, production, graphic design, marketing, and advertising. She has been the Business Manager at The Poly Post for the past 15 years and managed at Wells Fargo Financial prior to coming to Cal Poly Pomona. The business manager aids the students in developing new marketing plans, helps them refine their sales and technical skills, proposes layout and design advice for the magazine and newspaper, and provides guidance for industry standards. The business manager is also on-call and spends Sunday afternoons assisting the editors and approving pages before production."
        },
        {
            "q1": "Jason Y. Zhang",
            "q2": "Collins College of Hospitality Management",
            "q3": "Hospitality Management - Food & Beverage",
            "q4": "HRT 3830/HRT3830L - Food and Beverage Operations",
            "q5": "https://www.cpp.edu/rkr/",
            "q6": "Yes",
            "q8": "Curricular",
            "q9": "HRT3830/HRT3830L",
            "q10": "1-semester",
            "q12": "Every semester",
            "q14": "Students in the following majors, Sophomore, Junior, Senior",
            "q15": "Hospitality Management",
            "q16": "Yes",
            "q17": "Prerequisite(s): HRT 2020; HRT 276 or HRT 2760; HRT 281 or HRT 2810; HRT 281L or HRT 2810L; and HRT 302 or HRT 3020. Corequisite(s): HRT3830L.",
            "q18": "No",
            "application-id": "970",
            "email": "zhang2@cpp.edu",
            "description": "On a weekly basis, instruction team provide one-on-one coaching throughout services, digital feedback\/communication through BlackBoard and scheduled Zoom sessions. \n\nAfter each management week (where students run the restaurant as managers), instruction team conduct group feedback\/review sessions to go over, 1) financial performance, 2) personal management style, 3) vertical\/horizontal management results, 4) public speaking techniques, and many more. "
        }]
}
