{
    "entries": [
        {
            "one": "ANT4900: Methods in Anthropology",
            "two": "The course teaches students how to carry out ethnographic research from the development of a research question to a final conference presentation and ethnographic research article. Projects are health related and carried out in partnership with the Center for Health Disparities Research at UC Riverside’s School of Medicine. Students will gain an understanding of the social and structural mechanisms for how inequality “gets under the skin” while also gaining skills in participant observation, in-depth interviewing, life histories, material culture analysis, and qualitative data analysis using NVivo. Students are research assistants on the project and work collaboratively with undergraduate and graduate students at UC Riverside. The experience positions students for employment in the fields of social science research, public health, non-profit sectors and/or applying to graduate programs in anthropology, health sciences, and related professions. Past students have received intense mentorship, disseminated their research beyond the classroom, and work collaboratively on a multidisciplinary research team.",
            "four": "aldao@cpp.edu",
            "five": "Dao",
            "six": "Amy",
            "seven": "Letters, Arts & Social Sciences",
            "eight": "Geography and Anthropology",
            "nine": "Curricular",
            "ten": "1 academic year",
            "eleven": "Every year",
            "twelve": "Students in any major, Freshmen, Sophomore, Junior, Senior, Graduate Students",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "ANT4900: Methods in Anthropology",
            "thirteenb": "ANT1020 or instructor approval"
        },
        {
            "one": "HRT 3830/HRT3830L - Food and Beverage Operations",
            "two": "HRT 3830 - Food & Beverage Operations course, exemplifies the best of polytechnic learning. Undergraduate students sharpen their practical professional experience at the Restaurant at Kellogg Ranch (our classroom laboratory). Students rotate weekly through various positions in both the front of the house and back of the house, in order to learn all aspects of a food & beverage operation. Our goal is to enhance student learning by allowing them to provide excellent service to paying guests, prepare quality menu items in the kitchen, develop individual leadership style by managing their peers, and create and execute strategic restaurant management plans- all within an optimized & controlled environment. Students receive industry-standard feedbacks & training through our experienced instructors. The course is regarded by industry experts as the equivalent of a top-quality \"Manager-in-Training\" program; known to many top brands and their talent acquisition teams.",
            "three": "https://www.cpp.edu/rkr/",
            "four": "zhang2@cpp.edu",
            "five": "Zhang",
            "six": "Jason",
            "seven": "Hospitality",
            "eight": "Hospitality Management - Food & Beverage",
            "nine": "Curricular",
            "ten": "1 semester",
            "eleven": "Every Semester",
            "twelve": "Student in the following major(s), Sophomore, Junior, Senior",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "HRT3830/HRT3830L",
            "twelveb": "Hospitality Management",
            "thirteenb": "Prerequisite(s): HRT 2020; HRT 276 or HRT 2760; HRT 281 or HRT 2810; HRT 281L or HRT 2810L; and HRT 302 or HRT 3020. Corequisite(s): HRT"
        },
        {
            "one": "New Food Product Development FST 4290L: From the Classroom to National Competitions",
            "four": "gdavidov@cpp.edu",
            "five": "Davidov-Pardo",
            "six": "Gabriel",
            "seven": "Agriculture",
            "eight": "Nutrition and Food Science",
            "nine": "Curricular",
            "ten": "1 semester",
            "eleven": "Every year",
            "twelve": "Students in the following major(s), Senior, Graduate Students",
            "thirteen": "Yes",
            "fourteen": "No",
            "twelveb": "Food Science and Technology, MS in Agriculture-Nutrition and Food Science Option, FST Minor, Culinology minor",
            "thirteenb": "Prerequisite(s): C- or better in the following: FST 3180 or FST 318, FST 3220 or FST 322, FST 3250 or FST 325, FST 3321 or FST 332, BIO 2060 or MIC 201, BIO 2060L or MIC 201L; CHM 2010 or CHM 201, and CHM 2010L or CHM 250L. Corequisite(s): FST 4290."
        },
        {
            "one": "LTD Projects Hatchery",
            "two": "The Learn Through Discovery Projects Hatchery (Hatchery) provides students support and resources to explore ideas that they are passionate about and turn them into projects that have real impact on communities. With projects ranging from applied research, start-up's, to community events, students from all disciplines engage in three phases that first allow them to explore their topic (through identifying and understanding the problem to be solved), further develop their idea (by preparing a proposal and budget), and finally, implementing and assessing the project (the Hatchery provides up to $8,000 in funding at this phase). Students receive peer, staff, and faculty mentoring during the process and cross-collaborate with other students and faculty within the Hatchery.",
            "three": "https://www.cpp.edu/learndiscovery/hatchery/index.shtml",
            "four": "winnydong@cpp.edu",
            "five": "Dong",
            "six": "Winny",
            "seven": "University-wide",
            "eight": "Learn Through Discovery",
            "nine": "Co-curricular",
            "ten": "Other",
            "eleven": "Other",
            "twelve": "Students in any major, Freshmen, Sophomore, Junior, Senior, Graduate Students",
            "thirteen": "Yes",
            "fourteen": "No",
            "tenb": "Varies, can be as short as 1 semester or as long as several years.",
            "evelvenb": "Students can apply anytime.",
            "thirteenb": "Application can be found at: https://www.cpp.edu/learndiscovery/hatchery/join.shtml"
        },
        {
            "one": "McNair Scholars Program",
            "two": "The Cal Poly Pomona McNair Scholars Program prepares eligible undergraduate students for PhD programs by promoting student success through undergraduate research, faculty mentorship, and a series of skill building workshops. The program aims to increase the number of first-generation, low-income and/or underrepresented students in PhD programs, and eventually, to increase diversity among faculty at higher education institutions across the country. McNair Scholars are provided with opportunities to participate in research activities during the academic year and summer. Scholars attend our McNair Course (CPU 4750 and CPU 4760), seminars and workshops on topics related to graduate school preparation, conduct research under the guidance of a faculty mentor, and have the chance to present their research at conferences.",
            "three": "https://www.cpp.edu/mcnair/index.shtml",
            "four": "mcnair@cpp.edu",
            "five": "Alvarez",
            "six": "Elena",
            "seven": "University-wide",
            "nine": "Both curricular and co-curricular",
            "ten": "1 Academic Year",
            "eleven": "Every year",
            "twelve": "Students in any major, Sophomore, Junior, Senior",
            "thirteen": "Yes",
            "fourteen": "Yes",
            "nineb": "CPU 4750, CPU 4760, and CPU 4990",
            "thirteenb": "Application can be found at: https://www.cpp.edu/mcnair/application/index.shtml ; Students are also encouraged to apply to the McNair Preparatory Program prior to applying to the full program. (https://www.cpp.edu/mcnair/preparatory-program/index.shtml)",
            "fourteenb": "3.0"
        },
        {
            "one": "Women, Health, and Body Politics Zine Making",
            "two": "EWS 4430 - Women, Health, and Body Politics Zine Making is designed to educate and empower students to become active knowledge producers by contributing to two zine libraries on the Cal Poly Pomona campus. Located at the Pride Center and the Womxn’s Resource Center, these two cultural centers serve as ideal locations to share what students learn with the larger campus community. Zines are pieces of original art-activism. They are handmade magazines that generate visual and textual arguments that contribute to activist and social justice movements. By synthesizing their knowledge and applying it in inventive and purposeful ways, students in this course will demonstrate the knowledge they have gained about intersectional body politics and intersectional identities. Most impactfully, this course prepares students to became curious and imaginative change-makers.",
            "four": "skafai@cpp.edu",
            "five": "Kafai",
            "six": "Shayda",
            "seven": "Education & Integrative Studies",
            "eight": "Ethnic and Women's Studies",
            "nine": "Curriculuar",
            "ten": "1 Semester",
            "eleven": "Every Semester",
            "twelve": "Students in any major, Junior, Senior",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "EWS 4430",
            "thirteenb": "Junior or Senior standing; and Lower division GE requirements in Area A, at least two sub-areas in Area C, and at least two sub-areas in Area D."
        },
        {
            "one": "PolyPet Spa Day and Vaccine Clinic",
            "two": "The PolyPet Spa Day/Vaccine Clinic provides low-cost vaccines, microchipping, lab tests and other free services to local community pets.  Students from lower division classes collaborate with students from upper division classes to work this semi-annual event.  Students engage in intense mentorship before and during the event, apply critical thinking skills by determining individualized vaccine schedules and testing regimen, use communication skills to engage with clients, collaborate with other students, and disseminate veterinary medical information to the community at large.",
            "four": "jsohn@cpp.edu",
            "five": "Sohn",
            "six": "Joanne",
            "seven": "Agriculture",
            "eight": "Animal and Veterinary Sciences",
            "nine": "Curricular",
            "ten": "1 Semester",
            "eleven": "Every Semester",
            "twelve": "Students in the following major(s), Freshmen, Senior",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "AHS 1129L, AHS 3263L, AHS 4407L",
            "twelveb": "Animal Health Science",
            "thirteenb": "AHS 1129L Animal handling and restraint"
        },
        {
            "one": "Market Analysis in the Lodging Industry",
            "four": "lkwok@cpp.edu",
            "five": "Kwok",
            "six": "Linchi",
            "seven": "Hospitality",
            "eight": "Collins College of Hospitality Management",
            "nine": "Curricular",
            "ten": "1 Calendar year",
            "eleven": "Every year",
            "twelve": "Students in any major, Freshmen, Sophomore, Junior, Senior, Graduate students",
            "thirteen": "No",
            "fourteen": "No",
            "nineb": "HRT 4990 and HRT 4000"
        },
        {
            "one": "The Poly Post (news lab)",
            "two": "The Poly Post is a collaborative, experiential learning experience that relies on intense mentoring from its student editors and faculty adviser to create a rewarding newsroom environment and serve the information needs of the Cal Poly Pomona community. Editors manage their respective beats, assign stories, edit, fact-check and help staff writers navigate interviews and information gathering. The Poly Post leadership learns how to manage personalities and motivate staff. Student-journalists engage with all facets of the campus community – clubs, student orgs, ASI, academic senate, faculty, staff, alumni, and the administration – to inform the campus and distribute news to a diverse public audience. Students work with a variety of multimedia platforms to develop a portfolio of work; these include print and digital news stories, videos, photographs, graphics, and podcasts. The content is distributed through a weekly print edition and digital newsletter, a continuously updated website, and an annual magazine (the Bronco Guide). The staff also manage various social media accounts including Instagram, YouTube, and Twitter, and are working on the launch of a mobile news app. ",
            "three": "https://thepolypost.com",
            "four": "jmturcotte@cpp.edu",
            "five": "Turcotte",
            "six": "Jason",
            "seven": "Letters, Arts & Social Sciences",
            "eight": "Communication",
            "nine": "Curricular and Co-Curricular",
            "ten": "1 Academic Year",
            "eleven": "Every Semester",
            "twelve": "Students in the following major(s), Sophomore, Junior, Senior",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "COM3351 Newspaper Practices & COM4451 Adv. Newspaper Practices",
            "twelveb": "Communication majors or minors. It is required experience for multimedia journalism students, but other Com majors and minors with the prerequisites (COM1106/1107 and COM2217) may enroll. For those who do not meet the prerequisites, we welcome them to participate as freelance writers, photographers, graphic designers, and marketing/advertising associates.",
            "thirteenb": "COM1106 or 1107 Copyediting and COM2217 Reporting"
        },
        {
            "one": "Professional Work Experience Course",
            "two": "HRT 3410, Professional Work Experience, provides students an intense look at one’s knowledge, skills, and abilities and how to best leverage them for future career success. Students complete a battery of career engagement activities, including attending professional development workshops, reflection writing, resume development, practice interviewing software, to name a few.  Students disseminate their knowledge beyond the classroom by connecting with others on LinkedIn, Handshake, and informational interviewing. They receive intense mentorship through the resume refinement process, apply critical thinking skills by evaluating future career paths, use communication skills to connect with classmates through discussion board posts, collaborate with other students, and use their creativity to present themselves to differentiate themselves to employers from their peers.",
            "four": "AELara@cpp.edu",
            "five": "Lara",
            "six": "Ann",
            "seven": "Hospitality",
            "eight": "Collins College Of Hospitality Management",
            "nine": "Curricular",
            "ten": "1 Semester",
            "eleven": "Every Semester",
            "twelve": "Students in the following major(s), Junior, Senior",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "HRT 3410",
            "twelveb": "Hospitality Management",
            "thirteenb": "Complete 800 hours of hospitality work experience"
        },
        {
            "one": "ANT3500HS: Environment, Technology and Culture (Honors, Service-Learning)",
            "two": "ANT 3500HS Environment, Technology and Culture (Honors, Service-Learning) is a general education class (D4 or B5) that takes an applied anthropological approach to confronting the climate crisis and achieving sustainability goals. This course engages students in community-based action research projects in partnership with service-learning partners, including CHERP Locally Grown Power (LGP). Students have a unique opportunity to take part in a just transition to renewable energy by supporting CHERP LGP’s mission to establish the world’s first ever, non-profit solar panel assembly factory in Pomona, which will provide discounted electricity to low-income residents. Divided into teams based on particular interests and skills, students undertake group projects through intense mentorship with Dr. Blair, as well as dedicated staff at CHERP LGP. Projects may include, but are not limited to: community solar access and outreach; volunteer program design; workforce development; regenerative economic modeling; climate action policy implementation; environmental scan research; and GIS mapping. Students typically present their findings to CHERP LGP’s Board of Advisors and the broader community.",
            "four": "jblair@cpp.edu",
            "five": "Blair",
            "six": "James",
            "seven": "Letters, Arts & Social Sciences",
            "eight": "Geography and Anthropology",
            "nine": "Curricular and Co-Curricular",
            "ten": "1 Semester",
            "eleven": "Every Year",
            "twelve": "Students in any major, Freshmen, Sophomore, Junior, Senior",
            "thirteen": "Yes",
            "fourteen": "Yes",
            "nineb": "ANT3500HS: Environment, Technology and Culture (Honors, Service-Learning)",
            "thirteenb": "ANT 1020 – Introduction to Cultural Anthropology - or equivalent from other universities. Acceptance in Kellogg Honors College.",
            "fourteenb": "Acceptance in Kellogg Honors College"
        },
        {
            "one": "National Model United Nations (NMUN)",
            "three": "https://cppnmun.wixsite.com/modelun",
            "four": "scarcelli@cpp.edu",
            "five": "Scarcelli",
            "six": "Marc",
            "seven": "Letters, Arts & Social Sciences",
            "eight": "Political Science",
            "nine": "Curricular and Co-curricular",
            "ten": "1 Semester",
            "eleven": "Every Year",
            "twelve": "Students in any major, Freshmen, Sophomore, Junior, Senior, Graudate Students",
            "thirteen": "Yes",
            "fourteen": "No",
            "nineb": "CLS 4100 Model United Nations",
            "thirteenb": "Submit an application following this Google Forms application link. https://docs.google.com/forms/d/1--amR4X6TrKHTdkLflmbNl7pNPkRg3SoqzpzE3AKuw8/edit. Second, applicants will be contacted for an interview. Following interviews, those that have been selected to be on the team will be contacted with information regarding officially joining the program."
        }
    ]
}
